/* eslint-disable no-console */
/* eslint-disable no-unused-vars */
// Замените "// ... своим кодом

function first() {
  // передайте в функцию один параметр типа "число"
  // ...

  // передайте в функцию один параметр типа "строка"
  // ...

  // передайте в функцию один параметр логического типа
  // ...

  // передайте в функцию один параметр null
  // ...

  // передайте в функцию два любых параметра
  // ...

  // передайте в функцию три любых параметра
  // ...
}

function second(arg) {
  // верните тип значения параметра arg
  // ...
}

function third(a, b) {
  // верните максимальное число среди a и b
  // ...
}

function fourth(a, b, c, d, e, f, g, h) {
  // верните максимальное число среди a, b, c, d, e, f, g и h
  // ...
}

function fifth() {
  /*
    Напишите программу, которая выводит на экран числа от 1 до 100.
    При этом вместо чисел, кратных трем, программа должна выводить слово Fizz,
    а вместо чисел, кратных пяти — слово Buzz.
    Если число кратно пятнадцати, то программа должна выводить слово FizzBuzz.
  */

  // ...
}

function sixth() {
  /*
    Напишите цикл, который делает семь вызовов console.log и выводит следующее:
    #
    ##
    ###
    ####
    #####
    ######
    #######
  */

  // ...
}

export {
  first,
  second,
  third,
  fourth,
  fifth,
  sixth,
};
